---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightType.GetLossFactor
source: html/70ea1fae-a218-8367-25ca-a9fa13237b70.htm
---
# Autodesk.Revit.DB.Lighting.LightType.GetLossFactor Method

Return a copy of an object derived from LossFactor

## Syntax (C#)
```csharp
public LossFactor GetLossFactor()
```